
&НаКлиенте
Процедура ПровестиДокументы(Команда)
	ИдЗадания = "";
	Индикатор = 0; 
	СтрокаСостояния = "";
	
	ПараметрыЗапуска = Новый Структура();
	ПараметрыЗапуска.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыЗапуска.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
	ИдЗадания	= СтруктураФоновогоЗадания.ИдентиФикаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	//ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	//ПараметрыОжидания.Интервал = 2;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, 
		Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект), ПараметрыОжидания);
		
		// подключим обработку ожидания получения "отклика" на форму
	ПодключитьОбработчикОжидания("ОбработчикОжиданияИндикатор",2);
	
КонецПроцедуры


&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)

	НаименованиеЗадания = "Моя длительная операция";
	ВыполнитьМетод = "Ант_МойОбщийМодуль.ПерепроведениеДокументов";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
  ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполнитьМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции 


&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт
	
	ОтключитьОбработчикОжидания("ОбработчикОжиданияИндикатор");
	
	Если Результат = Неопределено Тогда 
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		ЭтаФорма.СтрокаСостояния = "Ошибка";
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		ЭтаФорма.Индикатор = 100; 
		ЭтаФорма.ПроцентВыполнения = "100%";
		ЭтаФорма.СтрокаСостояния = "Выполнено"
	КонецЕсли;
		
КонецПроцедуры 


//Для индекатора на форме

&НаКлиенте
Процедура ОбработчикОжиданияИндикатор()

	  Прогресс = ПрочитатьПрогресс(ИДЗадания);
		
		Если Не ТипЗнч(Прогресс) = Тип("Структура") Тогда
			ЭтаФорма.СтрокаСостояния = "";
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(Прогресс) = Тип("Структура") И Прогресс.Свойство("ЗавершеноАварийно") Тогда
			ОтключитьОбработчикОжидания("ОбработчикОжиданияИндикатор");
			Возврат;
		КонецЕсли;

		Если Прогресс.Свойство("ЗаданиеВыполнено") И Прогресс.ЗаданиеВыполнено Тогда
			ЭтаФорма.Индикатор = 100;
			ЭтаФорма.СтрокаСостояния = "Задание завершено."
		Иначе
			Если Прогресс.Свойство("Процент") Тогда
				ЭтаФорма.Индикатор = Прогресс.Процент;
				ЭтаФорма.ПроцентВыполнения = Строка(Прогресс.Процент) + "%";
			КонецЕсли;
			
			Если Прогресс.Свойство("Текст") Тогда
				ЭтаФорма.СтрокаСостояния = Прогресс.Текст;
			КонецЕсли;	
		КонецЕсли;
		
КонецПроцедуры 

&НаСервере
Функция ПрочитатьПрогресс(Знач ИдентификаторФоновогоЗадания)

	  Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФоновогоЗадания);
		
		Если Задание = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			ОтключитьОбработчикОжидания("ОбработчикОжиданияИндикатор");
			Возврат Неопределено;
		КонецЕсли;
		
		// используем БСП
		ПрогрессЗадания = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторФоновогоЗадания);
	
		Если ПрогрессЗадания = Неопределено 
			Или ТипЗнч(ПрогрессЗадания) <> Тип("Структура") Тогда
				ПрогрессЗадания = Новый Структура;
		КонецЕсли;
		
		ПрогрессЗадания.Вставить("ЗаданиеВыполнено", 
			ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторФоновогоЗадания));
			
		Возврат ПрогрессЗадания;
	
КонецФункции 
	

